app/Controllers/UserController.php

    public function processSignup()
    {
        $model = new UserModel();

        // Validate the form, including confirm_password validation
        $validationRules = [
            'email' => 'required|valid_email|is_unique[users.email]',
            'password' => 'required|min_length[6]',
            'confirm_password' => 'required|matches[password]' // Add this line to match passwords
        ];

        // Apply custom validation rules for confirm_password
        if (!$this->validate($validationRules)) {
            // Set the error messages to the session
            return redirect()->to('/signup')->withInput()->with('errors', $this->validator->getErrors());
        }

        // Collect the data from the form
        $data = [
            'email'    => $this->request->getPost('email'),
            'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
        ];

        // Save the user data to the database
        if ($model->save($data)) {
---
INSERT INTO `users` (`email`, `password`, `created_at`, `updated_at`) VALUES ('wako@gmail.com', '$2y$10$CQbrGaVkvL29AONemNvXn.MM9PdJND.bQX1hgxtmjRRM1OC8lWFju', '2025-02-01 09:24:59', '2025-02-01 09:24:59')

    public function processLogin()
    {
        $model = new UserModel();

        // Get the user from the database based on the email
        $user = $model->where('email', $this->request->getPost('email'))->first();
---
SELECT *
FROM `users`
WHERE `email` = 'wako@gmail.com'
 LIMIT 1